In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()

today = date.today()
today

datetime.date(2021, 12, 27)

In [2]:
sql = '''
SELECT S.* , B.net AS cost, B.qty, T.name
FROM sells S
JOIN buys B
ON buy_id = B.id
JOIN stocks T
ON B.stock_id = T.id
WHERE S.date = '%s'
ORDER BY T.name
'''
sql = sql % today
sells = pd.read_sql(sql, conpf)
sells

,id,buy_id,date,price,fee,vat,net,days,profit,percent,yearly,sequence,chart,dividend_id,cost,qty,name
0,889,284,2021-12-27,14.7,304.29,21.3,146674.41,1949,-20695.48,-12.36512,-2.31568,111,None,0,167369.89,10000,MCS

In [3]:
grouped = sells.groupby('name').agg(
{'qty':'sum',
 'price':'mean',
 'net':'sum',
 'cost':'sum',
 'profit':'sum'})
grouped

        qty  price        net       cost    profit
name
MCS   10000   14.7  146674.41  167369.89 -20695.48

In [4]:
grouped.net.sum(),grouped.cost.sum(),grouped.profit.sum()

(146674.41, 167369.89, -20695.48)

In [5]:
grouped.index

Index(['MCS'], dtype='object', name='name')

### Update table buy in stock database

In [6]:
names = sells.name.unique()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'MCS'"

In [7]:
sql = """
SELECT * 
FROM buy 
WHERE name IN (%s) 
ORDER BY name
"""
sql = sql % in_p
df = pd.read_sql(sql, const)
df

,name,date,volbuy,price,volsell,volbal,active,dividend,period,grade
0,MCS,2016-08-26,70000.0,16.7,0.0,0.0,1,1.37,2,A3

In [8]:
sqlUpd = '''
UPDATE buy
SET volbuy = 6000
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (in_p)
print(sqlUpd)

UPDATE buy
SET volbuy = 6000
WHERE name IN ('MCS')

In [9]:
rp = const.execute(sqlUpd)
rp.rowcount

11

In [11]:
sql = """
SELECT * 
FROM buy 
WHERE active = 0
ORDER BY name
"""
inactive_buy = pd.read_sql(sql, const)
inactive_buy

Empty DataFrame
Columns: [name, date, volbuy, price, volsell, volbal, active, dividend, period, grade]
Index: []

### Update table dividend in stock database

In [12]:
sqlUpd = '''
UPDATE dividend
SET shares = 0
WHERE name IN (%s)'''
sqlUpd = sqlUpd % (in_p)
print(sqlUpd)

UPDATE dividend
SET shares = 0
WHERE name IN ('POPF', 'SIS')

In [12]:
rp = const.execute(sqlUpd)
rp.rowcount

11

### Delete sales and update stocks in PortLite

In [13]:
sqlDel = """
DELETE FROM sales
WHERE name IN (%s)"""
sqlDel = sqlDel % in_p
print(sqlDel)

DELETE FROM sales
WHERE name IN ('ADVANC', 'BCP', 'CHG', 'JMT', 'KKP', 'ORI', 'PRM', 'TOA', 'TPIPP', 'TQM', 'WHART')

In [14]:
rp = conlite.execute(sqlDel)
rp.rowcount

0

In [15]:
sqlUpd = """
UPDATE stocks
SET status = 'X', available_qty = 0
WHERE name IN (%s)"""
sqlUpd = sqlUpd % in_p
print(sqlUpd)

UPDATE stocks
SET status = 'X', available_qty = 0
WHERE name IN ('ADVANC', 'BCP', 'CHG', 'JMT', 'KKP', 'ORI', 'PRM', 'TOA', 'TPIPP', 'TQM', 'WHART')

In [16]:
rp = conlite.execute(sqlUpd)
rp.rowcount

11

### Trace bakc process

In [17]:
#grouped.reset_index(level=0, inplace=True)
grouped.reset_index(level='name', inplace=True)
#level=['name', 'etc']
grouped

      name    qty   price        net       cost    profit
0   ADVANC    600  189.50  113448.16  114252.50   -804.34
1      BCP   6000   25.50  152661.12  162358.81  -9697.69
2      CHG  50000    3.78  188581.38  202447.42 -13866.04
3      JMT   2500   48.25  120357.83  101474.26  18883.57
4      KKP   3000   53.50  160144.50  165365.46  -5220.96
5      ORI  10000   10.30  102771.86   94208.20   8563.66
6      PRM  24000    6.55  156851.84  193627.92 -36776.08
7      TOA   3000   33.00   98780.72   99219.28   -438.56
8    TPIPP  60000    4.22  252639.20  251956.83    682.37
9      TQM   1800  108.00  193969.44  202046.54  -8077.10
10   WHART  10000   12.80  127716.49  133294.58  -5578.09

In [18]:
sql = '''
SELECT *
FROM price
WHERE date = '%s'
AND name IN (%s)
'''
sql = sql % (today, in_p)
print(sql)

SELECT *
FROM price
WHERE date = '2021-09-21'
AND name IN ('ADVANC', 'BCP', 'CHG', 'JMT', 'KKP', 'ORI', 'PRM', 'TOA', 'TPIPP', 'TQM', 'WHART')

In [19]:
prices = pd.read_sql(sql, const)
prices

      name        date   price    maxp    minp       qty    opnp
0   ADVANC  2021-09-21  193.00  193.00  189.00   7408634  189.50
1      BCP  2021-09-21   26.00   26.25   25.50   5799795   25.50
2      CHG  2021-09-21    3.82    3.88    3.78  66970604    3.78
3      JMT  2021-09-21   49.25   49.50   48.00   7350561   48.25
4      KKP  2021-09-21   54.50   54.75   53.50   2609657   53.50
5      ORI  2021-09-21   10.20   10.40    9.95  13937378   10.30
6      PRM  2021-09-21    6.65    6.65    6.45   5722239    6.55
7      TOA  2021-09-21   33.25   33.25   32.75   1200206   33.00
8    TPIPP  2021-09-21    4.24    4.26    4.20  11065219    4.22
9      TQM  2021-09-21  109.00  110.00  106.00    974973  108.00
10   WHART  2021-09-21   12.70   12.90   12.70   1488301   12.80

In [20]:
df_merge = pd.merge(grouped, prices, on='name', how='inner')
df_merge.dtypes

name        object
qty_x        int64
price_x    float64
net        float64
cost       float64
profit     float64
date        object
price_y    float64
maxp       float64
minp       float64
qty_y        int64
opnp       float64
dtype: object

In [21]:
cols = 'name qty_x price_x price_y'.split()
df_merge[cols]

      name  qty_x  price_x  price_y
0   ADVANC    600   189.50   193.00
1      BCP   6000    25.50    26.00
2      CHG  50000     3.78     3.82
3      JMT   2500    48.25    49.25
4      KKP   3000    53.50    54.50
5      ORI  10000    10.30    10.20
6      PRM  24000     6.55     6.65
7      TOA   3000    33.00    33.25
8    TPIPP  60000     4.22     4.24
9      TQM   1800   108.00   109.00
10   WHART  10000    12.80    12.70

In [22]:
df_merge['diff'] = df_merge.price_x - df_merge.price_y
df_merge['profit'] = (df_merge.price_x - df_merge.price_y) * df_merge.qty_x
cols = 'name qty_x price_x price_y diff profit'.split()
df_merge[cols]

      name  qty_x  price_x  price_y  diff  profit
0   ADVANC    600   189.50   193.00 -3.50 -2100.0
1      BCP   6000    25.50    26.00 -0.50 -3000.0
2      CHG  50000     3.78     3.82 -0.04 -2000.0
3      JMT   2500    48.25    49.25 -1.00 -2500.0
4      KKP   3000    53.50    54.50 -1.00 -3000.0
5      ORI  10000    10.30    10.20  0.10  1000.0
6      PRM  24000     6.55     6.65 -0.10 -2400.0
7      TOA   3000    33.00    33.25 -0.25  -750.0
8    TPIPP  60000     4.22     4.24 -0.02 -1200.0
9      TQM   1800   108.00   109.00 -1.00 -1800.0
10   WHART  10000    12.80    12.70  0.10  1000.0

In [23]:
df_merge.profit.sum()

-16750.000000000015

In [24]:
df_merge['diff2'] = df_merge.opnp - df_merge.price_y
df_merge['profit2'] = (df_merge.opnp - df_merge.price_y) * df_merge.qty_x
cols = 'name qty_x opnp price_y diff2 profit2'.split()
df_merge[cols]

      name  qty_x    opnp  price_y  diff2  profit2
0   ADVANC    600  189.50   193.00  -3.50  -2100.0
1      BCP   6000   25.50    26.00  -0.50  -3000.0
2      CHG  50000    3.78     3.82  -0.04  -2000.0
3      JMT   2500   48.25    49.25  -1.00  -2500.0
4      KKP   3000   53.50    54.50  -1.00  -3000.0
5      ORI  10000   10.30    10.20   0.10   1000.0
6      PRM  24000    6.55     6.65  -0.10  -2400.0
7      TOA   3000   33.00    33.25  -0.25   -750.0
8    TPIPP  60000    4.22     4.24  -0.02  -1200.0
9      TQM   1800  108.00   109.00  -1.00  -1800.0
10   WHART  10000   12.80    12.70   0.10   1000.0

In [25]:
df_merge.profit2.sum()

-16750.000000000015